Project/Toir/src/InformationRegisters/торо_ВерсииТехКарт/торо_ВерсииТехКарт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_ВерсииТехКарт</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>ТехКарта</name>
    <type>
      <types>CatalogRef.торо_ТехКарты</types>
    </type>
  </resources>
  <dimensions>
    <name>ИдентификаторТехКарты</name>
    <type>
      <types>CatalogRef.торо_ИдентификаторыТехКарт</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/InformationRegisters/торо_ВерсииТехКарт/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

// Возвращает версию тех. карты на указанную дату, либо на текущую дату, если ДатаСреза не заполнена.
// Параметры:
//		ИдентификаторТехКарты - СправочникСсылка.торо_ИдентификаторыТехКарт - идентификатор тех. карты.
//		ДатаСреза - Дата - дата, на которую нужно получить версию.
// Возвращаемое значение:
//		СправочникСсылка.торо_ТехКарты - версия тех. карты. Если версии нет, то пустая ссылка.
Функция ПолучитьВерсиюТехКарты(ИдентификаторТехКарты, ДатаСреза = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	торо_ВерсииТехКартСрезПоследних.ТехКарта КАК ТехКарта
	|ИЗ
	|	РегистрСведений.торо_ВерсииТехКарт.СрезПоследних(&Период, ИдентификаторТехКарты = &ИдентификаторТехКарты) КАК торо_ВерсииТехКартСрезПоследних";
	
	Запрос.УстановитьПараметр("ИдентификаторТехКарты", ИдентификаторТехКарты);
	Если ЗначениеЗаполнено(ДатаСреза) Тогда
		Запрос.УстановитьПараметр("Период", ДатаСреза);	
	Иначе
		Запрос.УстановитьПараметр("Период", ТекущаяДата());	
	КонецЕсли;
	
   Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ТехКарта;
	КонецЕсли;
	
	Возврат Справочники.торо_ТехКарты.ПустаяСсылка();
	
КонецФункции

#КонецОбласти
